Repository: Voxter256/Secret-Santa-Bot
Catalog: bot/locale/*/LC_MESSAGES/messages.po
Languages: de, fr, it, pt_br, ru

source: You must send me this in a private chat
de: Du musst mir das in einem privaten Chat schicken
fr: Vous devez m'envoyer ceci dans un chat privé
it: Devi inviarmelo in una chat privata
pt_br: Você deve me enviar isso em um bate-papo privado
ru: Вы должны отправить мне это в приватном чате

source: Hello! Lets get you setup!
de: Hallo! Lass uns dich einrichten!
fr: Salut! Permet de vous installer!
it: Ciao! Ti facciamo configurare!
pt_br: Olá! Vamos pegar sua configuração!
ru: Здравствуйте! Давайте приступим к настройке!

source: What is your address? (Reply to this message to change it)
de: Wie lautet Ihre Adresse? (Antworten Sie auf diese Nachricht, um sie zu ändern.)
fr: Quelle est ton adresse? (Répondez à ce message pour le modifier)
it: Qual è il tuo indirizzo? (Rispondi a questo messaggio per modificarlo)
pt_br: Qual é o seu endereço? (Responda a esta mensagem para alterá-la)
ru: Какой у Вас адрес? (Ответьте на это сообщение, чтобы изменить его)

source: You are already set up. I have your address as:
de: Sie sind bereits eingerichtet. Ich habe Ihre Adresse als:
fr: Vous êtes déjà configuré. J'ai votre adresse comme:
it: Sei già impostato. Ho il tuo indirizzo come:
pt_br: Você já está configurado. Eu tenho seu endereço como:
ru: Вы уже настроены. У меня есть ваш адрес:

source: Command List:
de: Befehlsliste:
fr: Liste des commandes:
it: Elenco dei comandi:
ru: Список команд:

source: Sent only in a private message to begin personal setup.
de: Wird nur in einer privaten Nachricht gesendet, um mit der persönlichen Einrichtung zu beginnen.
fr: Envoyé uniquement dans un message privé pour commencer la configuration personnelle.
it: Inviato solo in un messaggio privato per iniziare la configurazione personale.
pt_br: Enviado apenas em uma mensagem privada para iniciar a configuração pessoal.
ru: Отправляется только в личном сообщении, чтобы начать личную настройку.

source: Sent only in a group chat to enable the gift exchange.
de: Wird nur in einem Gruppenchat gesendet, um den Geschenkaustausch zu ermöglichen.
fr: Envoyé uniquement dans une discussion de groupe pour permettre l'échange de cadeaux.
it: Inviato solo in una chat di gruppo per abilitare lo scambio di regali.
pt_br: Enviado somente em um bate-papo em grupo para ativar a troca de presentes.
ru: Отправляется только в групповом чате для возможности обмена подарками.

source: Sent only in a private message to show and update your address.
de: Wird nur in einer privaten Nachricht gesendet, um Ihre Adresse anzuzeigen und zu aktualisieren.
fr: Envoyé uniquement dans un message privé pour afficher et mettre à jour votre adresse.
it: Inviato solo in un messaggio privato per mostrare e aggiornare il tuo indirizzo.
pt_br: Enviou apenas uma mensagem privada para mostrar e atualizar seu endereço.
ru: Отправляется только в личном сообщении для отображения и обновления вашего адреса.

source: Joins you in the gift exchange in this chat.
de: Hängt Sie an den Geschenkaustausch dieses Chats an.
fr: Vous rejoint dans l'échange de cadeaux dans ce chat.
it: Si unisce a te nello scambio di regali in questa chat.
pt_br: Junta-te a ti na troca de presentes neste chat.
ru: Присоединяется к вам в обмене подарками в этом чате.

source: Gets the status of this chat's exchange.
de: Gets the status of the exchange of this chat.
fr: Obtient le statut de l'échange de ce chat.
it: Ottiene lo stato dello scambio di questa chat.
pt_br: Obtém o status da troca deste bate-papo.
ru: Получает статус обмена в этом чате.

source: Prevents you from being paired up with this participant.
de: Verhindert, dass Sie mit diesem Teilnehmer gepaart werden.
fr: Vous empêche d'être jumelé avec ce participant.
it: Ti impedisce di essere associato a questo partecipante.
pt_br: Impede que você seja emparelhado com este participante.
ru: Предотвращает создание пары с этим участником.

source: Removes block that was preventing you from being paired up with this participant.
de: Entfernt den Block, der verhindert hat, dass Sie mit diesem Teilnehmer gekoppelt wurden.
fr: Supprime le bloc qui vous empêchait d'être associé à ce participant.
it: Rimuove il blocco che ti impediva di essere associato a questo partecipante.
pt_br: Remove o bloqueio que estava impedindo você de ser emparelhado com este participante.
ru: Удаляет блокировку, которая мешала вам соединиться с этим участником.

source: You will leave the gift exchange in this chat.
de: Sie werden den Geschenkaustausch in diesem Chat verlassen.
fr: Vous quitterez l'échange de cadeaux dans ce chat.
it: Lascerai lo scambio di regali in questa chat.
pt_br: Você vai deixar a troca de presentes neste chat.
ru: Вы оставите обмен подарками в этом чате.

source: Begins the gift exchange by assigning a recipient to every participant, then messaging them privately the details.
de: Beginnt den Geschenkaustausch, indem jedem Teilnehmer ein Empfänger zugewiesen und ihm dann privat die Details mitgeteilt werden.
fr: Commence l'échange de cadeaux en attribuant un destinataire à chaque participant, puis en leur transmettant les détails en privé.
it: Inizia lo scambio di regali assegnando un destinatario a ogni partecipante, quindi inviando loro un messaggio privato con i dettagli.
pt_br: Começa a troca de presentes atribuindo um destinatário a cada participante, depois enviando os detalhes em particular.
ru: Начинает обмен подарками, назначая получателя каждому участнику, а затем сообщая им детали в частном порядке.

source: Resets the gift exchange by removing every participant's assigned recipient.
de: Setzt den Geschenkaustausch zurück, indem der jedem Teilnehmer zugewiesene Empfänger entfernt wird.
fr: Réinitialise l'échange de cadeaux en supprimant le destinataire attribué à chaque participant.
it: Reimposta lo scambio di regali rimuovendo il destinatario assegnato a ogni partecipante.
pt_br: Redefine a troca de presentes removendo o destinatário atribuído de cada participante.
ru: Сбрасывает обмен подарками, удаляя всех назначенных получателей.

source: Send me a {command} in a private message, then follow the instructions!
de: Senden Sie mir einen {command} in einer privaten Nachricht und folgen Sie dann den Anweisungen!
fr: Envoyez-moi une {command} dans un message privé, puis suivez les instructions!
it: Inviami un {command} in un messaggio privato, quindi segui le istruzioni!
pt_br: Envie - me um {command} em uma mensagem privada e siga as instruções!
ru: Отправьте мне {command} в личном сообщении и следуйте инструкциям!

source: I currently have your address as {address}
de: Ich habe derzeit Ihre Adresse als {address}
fr: J'ai actuellement votre adresse en tant que {address}
it: Al momento ho il tuo indirizzo come {address}
pt_br: Atualmente tenho seu endereço como {address}
ru: В настоящее время у меня есть ваш адрес {address}

source: If that is correct, you can ignore the following message.
de: Wenn das richtig ist, können Sie die folgende Meldung ignorieren.
fr: Si cela est correct, vous pouvez ignorer le message suivant.
it: Se è corretto, puoi ignorare il seguente messaggio.
pt_br: Se isso estiver correto, você pode ignorar a seguinte mensagem.
ru: Если это верно, игнорируйте следующее сообщение.

source: OK, I have added your address as:
de: Bestätigt, ich habe Ihre Adresse hinzugefügt als:
fr: J'ai ajouté votre adresse comme:
it: Ho aggiunto il tuo indirizzo come:
pt_br: Eu adicionei seu endereço como:
ru: Я добавил ваш адрес как:

source: You can now to use {command} in any Telegram Secret Santa group!
de: Sie können jetzt {command} in jeder Gruppe von Telegram Secret Weihnachtsmann verwenden!
fr: Vous pouvez maintenant utiliser {command} dans n'importe quel groupe Telegram Père Noël Anonyme!
it: Ora puoi usare {command} in qualsiasi gruppo di Babbo Natale segreto di Telegram!
pt_br: Agora você pode usar {command} em qualquer grupo Telegram Secret Santa!
ru: Теперь вы можете использовать {command} в любой группе Telegram Секретный санта!

source: A Telegram Secret Santa group only needs to be activated once.
de: Eine Telegram Secret Weihnachtsmann Gruppe muss nur einmal aktiviert werden.
fr: Un groupe Telegram Père Noël Anonyme ne doit être activé qu'une seule fois.
it: Un gruppo di Babbo Natale segreto di Telegram deve essere attivato solo una volta.
pt_br: Um grupo Telegram Secret Santa só precisa ser ativado uma vez.
ru: Группу Telegram Секретный санта нужно активировать только один раз.

source: To do so, I must be a member of a telegram group and someone needs to activate me with the command {command}
de: Dazu muss ich Mitglied einer Telegrammgruppe sein und jemand muss mich mit dem Befehl {command} aktivieren.
fr: Pour ce faire, je dois être membre d'un groupe de télégrammes et quelqu'un doit m'activer avec la commande {command}
it: Per farlo, devo essere un membro di un gruppo Telegram e qualcuno deve attivarmi con il comando {command}
pt_br: Para fazer isso, eu devo ser um membro de um grupo de telegramas e alguém precisa me ativar com o comando {command}
ru: Для этого я должен быть членом группы телеграмм, и кто-то должен активировать меня с помощью команды {command}

source: You must begin from a group chat
de: Sie müssen mit einem Gruppenchat beginnen
fr: Vous devez commencer à partir d'une discussion de groupe
it: Devi iniziare da una chat di gruppo
pt_br: Você deve começar de um bate-papo em grupo
ru: Вы должны начать с группового чата

source: Hello!
de: Hallo!
fr: Salut!
it: Ciao!
pt_br: Olá!
ru: Здравствуйте!

source: This group chat now has the options of participating in a Secret Santa Exchange!
de: Dieser Gruppenchat bietet jetzt die Möglichkeit, an einem geheimen Weihnachtsmann-Austausch teilzunehmen!
fr: Ce chat de groupe offre désormais la possibilité de participer à un échange de Père Noël Anonyme!
it: Questa chat di gruppo ora ha la possibilità di partecipare a uno scambio di Babbo Natale segreto!
pt_br: Este bate-papo em grupo agora tem a opção de participar de um Secret Santa Exchange!
ru: В этом групповом чате теперь есть возможность участвовать в обмене секретным Санта-Клаусом!

source: {command} to participate
de: {command} zur Teilnahme
fr: {command} pour participer
it: {command} per partecipare
pt_br: {command} para participar
ru: {command} для участия

source: I need your address first! I am sending you a private message now.
de: Ich brauche zuerst deine Adresse! Ich sende Ihnen jetzt eine private Nachricht.
fr: J'ai besoin de votre adresse en premier! Je vous envoie un message privé maintenant.
it: Prima mi serve il tuo indirizzo! Ti mando un messaggio privato adesso.
pt_br: Eu preciso do seu endereço primeiro! Estou enviando uma mensagem particular agora.
ru: Мне сначала нужен твой адрес! Я отправляю вам личное сообщение.

source: Someone must say {command} first!
de: Jemand muss zuerst {command} sagen!
fr: Quelqu'un doit d'abord dire {command}!
it: Qualcuno deve prima dire {command}!
pt_br: Alguém deve {command} primeiro!
ru: Кто-то должен сначала сказать {command}!

source: OK, you're in!
de: Du bist in!
fr: Vous y êtes!
it: Sei in!
pt_br: Você está dentro!
ru: ты в!

source: You have already joined!
de: Du bist schon beigetreten!
fr: Vous avez déjà rejoint!
it: Ti sei già iscritto!
pt_br: Você já se juntou!
ru: Вы уже присоединились!

source: This blocked pairing has already been added.
de: Diese blockierte Paarung wurde bereits hinzugefügt.
fr: Cette association bloquée a déjà été ajoutée.
it: Questo accoppiamento bloccato è già stato aggiunto.
pt_br: Este par bloqueado já foi adicionado.
ru: Это заблокированное сопряжение уже добавлено.

source: Don't worry, you won't get yourself
de: Mach dir keine Sorgen, du wirst dich nicht bekommen
fr: Ne t'inquiète pas, tu ne te comprendras pas
it: Non preoccuparti, non ti prenderai
pt_br: Não se preocupe, você não vai conseguir
ru: Не волнуйся, ты не получишь себя

source: OK, you can no longer matched with that participant.
de: Verstanden, Sie können nicht mehr mit diesem Teilnehmer übereinstimmen.
fr: Vous ne pouvez plus faire correspondre ce participant.
it: Non puoi più abbinare a quel partecipante.
pt_br: OK, você não pode mais corresponder a esse participante.
ru: Вы больше не можете соответствовать этому участнику.

source: This participant needs to join first
de: Dieser Teilnehmer muss zuerst beitreten
fr: Ce participant doit d'abord s'inscrire
it: Questo partecipante deve prima iscriversi
pt_br: Este participante precisa participar primeiro
ru: Этот участник должен сначала присоединиться

source: You can now be assigned to {name}
de: Sie können jetzt {name} zugewiesen werden
fr: Vous pouvez maintenant être affecté à {name}
it: Ora puoi essere assegnato a {name}
pt_br: Agora você pode ser atribuído a {name}
ru: Теперь вас могут назначить на {name}

source: {name} was not blocked by you.
de: {name} wurde von dir nicht blockiert.
fr: {name} n'a pas été bloqué par vous.
it: {name} non è stato bloccato da te.
pt_br: {name} não foi bloqueado por você.
ru: {name} не был заблокирован вами.

source: You never joined
de: Du bist nie beigetreten
fr: Tu n'as jamais rejoint
it: Non ti sei mai unito
pt_br: Você nunca se juntou
ru: Вы никогда не присоединялись

source: Done.
de: Erledigt.
fr: Terminé.
it: Fatto.
pt_br: Feito.
ru: Выполнено.

source: The exchange has not begun
de: Der Austausch hat noch nicht begonnen
fr: L'échange n'a pas commencé
it: Lo scambio non è iniziato
pt_br: A troca não começou
ru: Обмен не начался

source: The exchange has finished
de: Der Austausch ist beendet
fr: L'échange est terminé
it: Lo scambio è terminato
pt_br: A troca terminou
ru: Обмен завершен

source: Joined Users:
de: Verbundene Benutzer:
fr: Utilisateurs rejoints:
it: Utenti iscritti:
pt_br: Usuários Ingressados
ru: Присоединенные пользователи:

source: Cannot pair with:
de: Kann nicht gepaart werden mit:
fr: Impossible de jumeler avec:
it: Impossibile accoppiare con:
pt_br: Não foi possível emparelhar com:
ru: Невозможно соединиться с:

source: No one has Joined!
de: Niemand ist beigetreten!
fr: Personne n'a rejoint!
it: Nessuno si è iscritto!
pt_br: Ninguém se juntou!
ru: Никто не присоединился!

source: The exchange has already been setup!
de: Der Austausch wurde bereits eingerichtet!
fr: L'échange est déjà configuré!
it: Lo scambio è già stato impostato!
pt_br: A troca já foi configurada!
ru: Обмен уже настроен!

source: Matching Impossible: 0 Permutations
de: Matching Impossible: 0 Permutationen
fr: Correspondance impossible: 0 permutations
it: Corrispondenza impossibile: 0 permutazioni
pt_br: O emparelhamento é impossível: 0 combinações potenciais
ru: Совпадение невозможно: 0 перестановок

source: Messages have been sent!
de: Nachrichten wurden gesendet!
fr: Des messages ont été envoyés!
it: I messaggi sono stati inviati!
pt_br: Mensagens foram enviadas!
ru: Сообщения отправлены!

source: Error: {error}. Error ID: {id}
de: Error: {error}. Fehler-ID: {id}
fr: Erreur: {error}. ID d'erreur: {id}
it: Errore: {errore}. ID errore: {id}
pt_br: Erro: {error}. ID do erro: {id}
ru: Ошибка: {error}. Идентификатор ошибки: {id}

source: You got {username}!
de: Du hast {username}!
fr: Vous avez {username}!
it: Hai {username}!
pt_br: Você tem {username}!
ru: У вас есть {username}!

source: Their address is: {address}.
de: Ihre Adresse lautet: {address}.
fr: Leur adresse est: {address}.
it: Il loro indirizzo è: {address}.
pt_br: O endereço deles é: {address}.
ru: Их адрес: {address}.

source: All pairings have been reset
de: Alle Paarungen wurden zurückgesetzt
fr: Tous les appariements ont été réinitialisés
it: Tutti gli accoppiamenti sono stati ripristinati
pt_br: Todos os pares foram redefinidos
ru: Все пары были сброшены
